Repository: ehsanrezaee/DotNetBackend
Catalog: src/ErSoftDev.DomainSeedWork/Resources/SharedTranslate.*.resx
Languages: fa_ir

# AllFieldsOfAddressMustBeFillOrNonOfFields
source: Neither all field off address must be fill nor none of it
fa_ir: یا همه ی فیلد های آدرس باید پر شوند یا هیچکدام از آنها

# AlreadyExists
source: The record has already been saved with the submitted details
fa_ir: با مشخصات ارسالی قبلا رکوردی در دیتابیس ذخیره شده است

# BadRequest
source: One of the parameters is faulty
fa_ir: یکی از پارامتر های ارسالی ایراد دارد

# DbError
source: An error occurred in the database
fa_ir: خطا در دیتابیس رخ داده است

# Failed
source: Operation is failed
fa_ir: خطا در انجام عملیات

# LogicError
source: A logical error has occurred
fa_ir: خطای منطقی رخ داده است

# NotFound
source: Recorde not found
fa_ir: رکوردی یافت نشد

source: One of the browser or device name must be fill
fa_ir: حداقل یکی از مقادیر مرورگر یا نام دستگاه باید پر شود

# ParametersAreNotValid
source: Input parameter is not valid
fa_ir: پارامتر های ارسالی معتبر نمی باشد

source: Passwords are not equal
fa_ir: رمز های عبور یکسان نمی باشند

source: Refresh token is deactive
fa_ir: رفرش توکن غیر فعال می باشد

# RefreshTokenIsExpire
source: Refresh token is expired
fa_ir: زمان استفاده از رفرش توکن منقضی شده است

# RefreshTokenIsRevoked
source: Refresh token is revoked earlier
fa_ir: رفرش توکن باطل شده است

# RefreshTokenIsUsed
source: Refresh token is used earlier
fa_ir: رفرش توکن قبلا استفاده شده است

# Success
source: Operation is success
fa_ir: عملیات با موفقیت انجام شد

source: Token has not claim
fa_ir: اطلاعات توکن ناقص می باشد

# TokenIsExpired
source: The token expiration date has arrived, you can use GetToken or TokenRefresh services to receive new tokens.
fa_ir: تاریخ انقضای توکن فرا رسیده است ، جهت دریافت توکن جدید میتوانید از سرویس های گت توکن یا رفرش توکن استفاده نمایید.

# TokenIsNotSafeWithSecurityStamp
source: Token has not security stamp
fa_ir: توکن امن فاقد مهر امنیتی می باشد

# Unauthorized
source: Request is not authorized
fa_ir: دسترسی وجود ندارد

# Unknown
source: Operation Is Unknown
fa_ir: وضعیت تراکنش نامشخص می باشد

source: Username or password is not correct
fa_ir: نام کاربری یا رمز عبور اشتباه است

source: Request has not token
fa_ir: درخواست ارسالی فاقد توکن می باشد

source: Token is not valid
fa_ir: توکن معتبر نمی باشد

source: Security stamp token is not valid
fa_ir: شناسه امنیتی داخل توکن معتبر نمی باشد

# ProviderNotAvailable
source: Provider is not available
fa_ir: سرویس دهنده در دسترس نمی باشد

# UnhandledExceptionHappened
source: Unhandled exception happen
fa_ir: خطای پیش بینی نشده ای اتفاق افتاده است
